tests/load-tests/test1/login-analytics.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 30
      arrivalRate: 10 
    - duration: 120
      arrivalRate: 50
scenarios:
  - flow:
      - post:
          url: "/auth/login"
          json:
            username: "test"
            password: "test"
      - get:
          url: "/analytics"